Revit 2027 API
StructuralSectionGeneralH.WallNominalThickness Property
 Represents wall nominal thickness of rectangle.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double WallNominalThickness { get; set; }
Public Property WallNominalThickness As Double
	Get
	Set
public:
property double WallNominalThickness {
	double get ();
	void set (double value);
}
member WallNominalThickness : float with get, set
Property Value
Double
Remarks
 Nominal is measured real value of profile, should be thicker than designed.
See Also
Reference
StructuralSectionGeneralH Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace